[
  {
    "company": "spotify",
    "role": "Audience Development Partner Manager (Contract)",
    "location": "Tokyo",
    "job_description": "<div>Using our expert knowledge of talk audio and video content, partnerships, marketing, data-driven insights, and digital culture, we steer Spotify in its journey to become the leading platform for spoken-word content. We directly impact the way the world experiences podcasts and video podcasts.</div><div><br></div><div>We are looking for a hardworking and skilled Audience Development and Partner Manager to join our Japan Podcast team. This person is an experienced curator and strategist, capable of leading Spotify’s efforts in localized podcast and video podcast programming while managing productive B2B partnerships. You will play a meaningful role in defining and implementing Spotify’s editorial and content promotion strategy in your local market, working closely with programming, product, marketing, and data teams.</div><div><br></div><div>Our collective mission is to drive growth and discovery for podcasts and video podcasts on and off platform, working hand in hand with creators and partners to expand audiences and increase engagement.</div><div><br></div><div>This is a <u>contract position</u> for parental coverage till April 2027.</div>",
    "apply_url": "https://jobs.lever.co/spotify/015ad88e-c31d-4d01-830c-974fa8f202bb",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Data Scientist - Finance Data & Insights, Ads and Podcasts",
    "location": "New York, NY",
    "job_description": "<div>We are looking for a Data Scientist to join our Ads and Podcasts team within the Finance Data &amp; Insights organization. This role is perfect for someone who enjoys combining strong SQL, Python, and data skills with a deep curiosity for how financial data drives business decisions.</div><div><br></div><div>Your mission will be to build automated systems supporting data operations for enterprise and individual podcast creator payout calculations, perform analytics over advertising revenue, and provide insights to both internal and external stakeholders within Accounting, Financial Planning &amp; Analysis (FP&amp;A), and the broader Finance organization.</div><div><br></div><div>This role will also include opportunities to build AI data infrastructure for our Finance organization.</div>",
    "apply_url": "https://jobs.lever.co/spotify/6dfd1d6f-5efc-473a-aa48-8026eea476fc",
    "source": "lever",
    "role_family": "backend_engineer",
    "resume_variant": "backend_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Editor",
    "location": "São Paulo",
    "job_description": "<div>Our Artist &amp; Label Partnerships team, works with key artists, managers and labels to advocate, educate and innovate, unlocking opportunities such as campaigns, music programs and critical initiatives. </div><div><br></div><div><span style=\"font-size: 11pt;\">As an Editor, you will be encouraged to make data informed decisions, and bring deep cultural and music expertise and insights to craft creative narratives and highly engaging music experiences for listeners. Above all, your work will impact the way the world experiences music!</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You will demonstrate a passion for performance-oriented analytics and will have your ear to the ground in music communities for the latest sounds and trends, with a focus on Brazilian youth culture.</span></div><div><br></div>",
    "apply_url": "https://jobs.lever.co/spotify/44168e72-5ac5-4d6b-a486-9564025751e9",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Editor",
    "location": "Paris",
    "job_description": "<div>We are looking for an experienced Editor for Western Europe region (Belgium, France Luxembourg), to join Spotify’s Music Editorial team based in Paris. In this role you will be part of the Music team in the Western Europe region</div><div><br></div><div>You will contribute your expertise to various music-related projects within the company, including playlist curation, creative editorial work, and cross-functional collaboration with different teams in the region and beyond. You will provide deep cultural and musical insights to build highly engaging and cohesive music experiences for listeners, extending beyond playlists, while ensuring an unbiased editorial voice for a wide array of moods, moments, and genres. Additionally, you will drive artist discovery through an extensive editorial ecosystem of playlists and tools, critically assessing music trends and user behaviour to identify opportunities and emerging trends.</div><div><br></div><div>You will demonstrate a team player spirit, a passion for performance-oriented analytics, and a solid understanding of Spotify’s role in the music industry both locally and globally. Additionally, you will have an editorial personality that thrives in engaging audiences through creative formats, bringing the playlists to life in innovative ways.</div><div><br></div><div>As a music editor, you will be encouraged to make data-informed decisions while also contributing creative and cultural expertise. Above all, your work will impact the way the world experiences music!</div>",
    "apply_url": "https://jobs.lever.co/spotify/e51725d1-0edd-4754-9c01-d4566d1aaca3",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Global Classical Editor",
    "location": "London",
    "job_description": "<div>We are looking for an experienced and passionate Music Programmer with a focus on Classical music to join Spotify’s Music team in London. You will identify and curate first rate music playlist listening experiences using all available Classical content on platform (Frontline and Catalogue), including leanback experiences covering a broad array of moods, moments and instruments. You demonstrate a passion for performance-oriented analytics and strategic thinking and you have your ear to the ground in the Classical music community.&nbsp;</div>",
    "apply_url": "https://jobs.lever.co/spotify/f8d4783a-c863-4473-81b6-99177d06faa7",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Head of Editorial, Northern Europe (UK, IE, NL)",
    "location": "London",
    "job_description": "<div>As Head of Editorial for Northern Europe, you will lead Spotify’s editorial strategy and approach across the UK, Ireland, and the Netherlands. You will be responsible for shaping how listeners in these markets experience music on Spotify across playlists, programming, and emerging editorial formats. You’ll collaborate closely with cross-functional partners locally and globally, build and manage a high-performing team of editors, develop editorial talent, and strengthen Spotify’s role as a trusted, culturally relevant voice in the music landscape!</div><div><br></div><div>Reporting to the regional Head of Music, you will guide the editorial vision, oversee our playlist ecosystem, champion creative storytelling, and elevate how Spotify shows up around artists, genres, and cultural moments. You’ll bring a strong editorial perspective, a deep understanding of local and global music cultures, and the ability to translate insights and trends into compelling audience experiences. This role also includes leading editorial video efforts in the region and shaping on-camera presentation styles, collaborating with production teams, and experimenting with new formats.</div>",
    "apply_url": "https://jobs.lever.co/spotify/ef7a0b27-c432-4dda-a8c6-95575914691c",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Project Manager - Music Go-To-Market",
    "location": "Stockholm",
    "job_description": "<div>With millions of users in 178 countries, Spotify has transformed the way people access, discover, and enjoy music and podcasts. We are now looking for a Project Manager to drive initiatives that shape the future of music consumption and editorial voice on Spotify. In this role, you will support highly cross-functional product initiatives that depend on music content, editorial insight, and partner participation. Your counterparts will primarily be teams in Product and Editorial, but you will also deal with Artist &amp; Label Partnerships, Marketing, Legal, Data Science, Design etc.</div><div><br></div><div>The Partner &amp; Editorial Product GTM team connects Music Partnerships, Editorial, and Product - ensuring that new products for artist expression and music discovery work well for listeners and for key partners like artists, labels, and managers. You will be responsible for leading product pilots, shaping content strategy, and driving industry adoption with a focus on Editorial and Agentic products. This work is highly strategic and will directly influence the success of the business.</div>",
    "apply_url": "https://jobs.lever.co/spotify/c67a7843-c7d5-433b-9124-0f141c7420b2",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Senior Content Designer - Consumer Experience",
    "location": "London",
    "job_description": "<div><span style=\"font-size: 11pt;\">Help design how Spotify communicates, guides, and supports listeners through intelligent, intuitive experiences. We are seeking a Senior Content Designer to craft the language, systems, and behaviors that define how people interact with Spotify’s AI-powered and traditional product surfaces.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This role sits at the intersection of language, interaction, and adaptive technology. You’ll craft experiences that feel clear, warm, and unmistakably Spotify — whether through system messages, guidance flows, dynamic interfaces, or emerging AI features. The work you do will influence how our products speak, respond, and evolve across millions of moments every single day.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Whether your background is in Content Design, UX Writing, Product Design, or Systems Design, you’ll have space to explore innovative ways to develop robust editorial models, and help define the next generation of content-led experiences at Spotify.</span></div>",
    "apply_url": "https://jobs.lever.co/spotify/105aa2e0-e1ce-47c1-9d6e-0659e5b02882",
    "source": "lever",
    "role_family": "integration_engineer",
    "resume_variant": "integration_engineer",
    "match_score": 2
  },
  {
    "company": "spotify",
    "role": "Senior Fullstack Engineer - Platforms & Partner Experience",
    "location": "Stockholm",
    "job_description": "<div>Delivering the best Spotify experience possible. To as many people as possible. In as many moments as possible. That’s what the Experience team is all about. We use our understanding of how people engage with music, podcasts, and video to bring Spotify to life across every platform and device. If you enjoy building smooth, reliable playback experiences that reach millions every day, we’d love to have you join us.</div><div><br></div><div>Spotify reaches listeners through a wide ecosystem of first-party and partner-built applications  on web, desktop, mobile, and beyond. To support this variety, this team builds the shared playback, evaluation, and reliability foundations that power every streaming moment at Spotify.</div><div><br></div><div>We’re looking for a Senior Software Engineer to join our Platforms &amp; Partner Experience team. In this role, you’ll help build and evolve a reliable, high-performance media SDK that powers Spotify’s web and JavaScript surface. This SDK supports both first-party products and partner integrations, delivering consistent, high-quality playback and resilience across audio and video. This work will help millions of listeners and hundreds of partners experience seamless playback wherever Spotify plays.</div>",
    "apply_url": "https://jobs.lever.co/spotify/2fb93dd1-0fe0-4357-82dc-51f81b1eb4d1",
    "source": "lever",
    "role_family": "backend_engineer",
    "resume_variant": "backend_engineer",
    "match_score": 2
  }
]